Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/consumer_affairs/telecommunications_and_postal_services/connecting_to_the_internet_from_your_home.html.txt.tmx
Source language: en
Languages: ga

source: Connecting to the internet
ga: Ceangal leis an idirlíon ón mbaile

source: There are many different options for accessing the internet from your home
ga: Tá go leor roghanna éagsúla ann chun an t-idirlíon a rochtain

source: Common methods of Internet access by users include:
ga: I measc na modhanna coiteanna chun rochtain a fháil ar an Idirlíon, tá an méid a leanas:

source: • Dial-up with a computer modem via a telephone line
ga: • diailiú le móideim ríomhaire trí líne ghutháin nó

source: • Broadband over designated cables
ga: • leathanbhanda thar cháblaí sainithe nó

source: • Wireless connections using Wi-Fi, satellite and mobile phone technology
ga: • naisc gan sreang trí theicneolaíocht Wi-Fi, satailíte agus ghuthán póca a úsáid

source: The option you choose can depend on cost, connection speed, quality of connection and whether a service is available in your area
ga: Féadfaidh an rogha a roghnaíonn tú brath ar chostas, luas an naisc, cáilíocht an naisc agus ar cibé acu an bhfuil nó nach bhfuil seirbhís ar fáil i do cheantar

source: The Commission for Communications Regulation (ComReg) provides information on internet services on Comreg's website
ga: Soláthraíonn an Coimisiún um Rialáil Cumarsáide (ComReg) freagraí ar Cheisteanna Coitianta (CCanna) faoi sheirbhísí idirlín

source: Internet service providers are regulated by Commission for Communications Regulation (ComReg)
ga: Tá soláthraithe seirbhíse idirlín rialaithe ag ComReg

source: You can find a internet service providers authorised to operate in Ireland on ComRegs website
ga: Féadfaidh tú teacht ar liosta de sholáthraithe seirbhíse idirlín atá údaraithe le hoibriú in Éirinn ar láithreán gréasáin ComReg

source: Some internet service providers can also provide phone and television services
ga: Féadfaidh roinnt soláthraithe seirbhíse idirlín seirbhísí gutháin agus teilifíse a sholáthar chomh maith

source: You can subscribe to a different service provider for internet and telephone purposes if you wish
ga: Féadfaidh tú suibscríobh le soláthraí seirbhíse éagsúil do chuspóirí idirlín agus teilifíse, más mian leat

source: Shop around for the best package that meets your needs
ga: Ba cheart duit súil a chaitheamh thart chun an pacáiste is fearr a aimsiú a fhreastalaíonn ar do riachtanais

source: ComReg’s independent price guide will allow you to compare the costs of home phone, broadband, mobile phone and combined packages for your specific usage needs
ga: Cuirfidh treoir praghais neamhspleách ComReg ag www.callcosts.ie ar do chumas costais phacáistí guthán baile, leathanbhanda agus guthán póca agus chomhphacáistí a chur i gcomparáid lena chéile do do riachtanais shonracha úsáide

source: Broadband is a term for high speed internet access
ga: Úsáidtear an téarma Banda Leathan i dtaobh deis ardluais ar an idirlíon

source: Broadband allows users to access bigger amounts of data such as large video files
ga: Cuireann leathanbhanda ar chumas úsáideoirí chun rochtain a fháil ar mhéideanna níos mó sonraí, ar nós comhaid mhóra

source: The benefit of broadband is its speed and that it is always on
ga: Is é an tairbhe a bhaineann le leathanbhanda ná a luas agus go mbíonn sé ar siúl i gcónaí

source: There are a number of broadband technologies that enable you to access the internet quickly
ga: Tá roinnt teicneolaíochtaí leathanbhanda ann a chuireann ar do chumas rochtain a fháil ar an idirlíon go tapa

source: Digital subscriber line (DSL), fibre-optic, cable, mobile and satellite are all technologies that provide high speed access to the internet
ga: Teicneolaíochtaí iad líne dhigiteach rannpháirtí (DSL), cábla snáthoptaice, soghluaiste agus satailít go léir a sholáthraíonn rochtain ardluais ar an idirlíon

source: There are many different providers of Broadband and each will have a different package for the provision of services
ga: Is iomaí soláthraí éagsúil Leathanbhanda atá ann agus beidh pacáiste éagsúil ag gach ceann díobh chun seirbhísí a sholáthar

source: Most offer a flat rate which means that you will be charged the same for provision of services every month. There may be a limit on the amount you can download
ga: Cuireann an chuid is mó díobh bunráta ar fáil a chiallaíonn go ngearrfar an táille chéanna ort ar sheirbhísí a sholáthar gach mí

source: Make sure that you are happy with these limits when you subscribe to the service
ga: Bí cinnte go bhfuil tú sásta leis na teorainneacha sula nglacann tú síntiús leis an tseirbhís

source: Broadband speed is measured in Mb (megabits) per second
ga: Déantar luas leathanbhanda a thomhas de réir Mbanna (meigighiotáin sa soicind)

source: Download refers to the speed with which you can receive content from the Internet
ga: Tagraíonn íoslódáil don luas is féidir leat ábhar a fháil ón Idirlíon

source: Upload refers to the speed with which you can send content
ga: Tagraíonn uaslódáil don luas is féidir leat ábhar a sheoladh

source: Most people download much more than they upload, therefore Broadband download speeds are always set to be faster than upload speeds
ga: Déanann formhór na ndaoine i bhfad níos mó a íoslódáil ná mar a dhéanann siad a uaslódáil, ar an ábhar sin, bíonn luasanna íoslódála Leathanbhanda i gcónaí níos tapúla ná luasanna uaslódála

source: More information on Broadband internet access and Broadband providers is available from ComReg
ga: Féadfaidh tú teacht ar bhreis faisnéise ar rochtain idirlín Leathanbhanda agus ar sholáthraithe Leathanbhanda

source: June 2015, the government announced the National Broadband Plan
ga: I Meitheamh 2015, d’fhógair an rialtas an Plean Náisiúnta Leathanbhanda

source: This is a State intervention to make broadband available nationally because commercial operators have made it clear that there are large parts of the country that they cannot make high speed broadband services available commercially
ga: Idirghabháil Stáit é seo chun leathanbhanda a chur ar fáil go náisiúnta mar gheall gur shoiléirigh oibreoirí tráchtála gurb ann do chodanna móra den tír nach féidir leo seirbhísí leathanbhanda ardluais a chur ar fáil dóibh ar bhonn tráchtála

source: While the internet can be a source of knowledge and entertainment for children, there also can be dangers for children
ga: Cé gur féidir an t-idirlíon a bheith ina foinse eolais agus siamsaíocht do leanaí, is féidir a bheith ann freisin contúirtí do leanaí

source: The Office for Internet Safety (OIS) was established in March 2008 within the Department of Justice and Equality to promote internet safety
ga: Bunaíodh an Oifig um Shábháilteacht Idirlín (OSI) Márta 2008 laistigh den Roinn Dlí agus Cirt agus Comhionannais a chur chun cinn sábháilteachta idirlín

source: Information and advice on internet safety is available on its website internetsafety.ie
ga: Tá eolas agus comhairle faoi shábháilteacht ar an idirlíon ar fáil ar a láithreán gréasáin internetsafety.ie

source: Information on the safe use of the internet is available at makeitsecure.org
ga: Tá eolas ar úsáid shábháilte an idirlín ar fáil ag makeitsecure.org

source: A service called hotline.ie, which is run by the Internet Service Providers Association of Ireland (ISPAI), was setup to provide an anonymous reporting service for members of the public who want to report suspected illegal content which they have encountered on the Internet
ga: Bhí seirbhís ar a dtugtar hotline.ie, atá á reáchtáil ag an Idirlíon Seirbhís Soláthraithe Cumann na hÉireann (ISPAI), thus chun seirbhís tuairiscithe gan ainm do bhaill den phobal ar mian leo a thuairisciú ábhar neamhdhleathach amhras a bhíonn siad ar an Idirlíon

source: Hotline.ie's primary aim is to combat child pornography, however, other forms of illegal content and activities on the Internet may be reported using this service
ga: Sa chás go mbíonn tú míshásta le gné ar bith den tseirbhís idirlín atá agat ba cheart duit, ar an gcéad dul síos, é sin a chur in iúl don soláthraí seirbhíse

source: Their website also provides safety advice for parents and children on using the internet
ga: Is féidir tuilleadh a léamh anseo maidir le gearán a dhéanamh le ComReg

source: Consumer contracts are protected by the Sale of Goods and Supply of Services Act, 1980
ga: Tá conarthaí tomhaltóra cosanta faoin Acht um Dhíol Earraí agus Soláthar Seirbhísí, 1980

source: If you have a contract with a service supplier you can expect that:
ga: Sa chás go bhfuil conradh agat le soláthraí seirbhíse, is féidir a bheith ag súil

source: • The supplier has the necessary skill to provide the service
ga: • go bhfuil an scil is gá ag an soláthraí chun an tseirbhís a chur ar fáil

source: • The service will be provided with proper care and diligence
ga: • go gcuirfear an tseirbhís ar fáil leis an gcúram agus an dúthracht is dual

source: • The materials used will be sound and that goods supplied with the service will be of merchantable quality
ga: • go mbeidh an t-ábhar a úsáidtear slán agus go mbeidh na hearraí a sholáthraítear leis an tseirbhís ar chaighdeán indíolta

source: You can read more about your rights when you buy a service
ga: Is féidir tuilleadh a léamh maidir le do chuid cearta nuair a cheannaíonn tú seirbhís anseo

source: This document tells you how to complain. If you have exhausted the customer complaints mechanism of the service provider and are still dissatisfied you can contact ComReg who may, depending on the complaint, be able to help you. You can read more about making complaints about your service provider
ga: Má bhain tú triail cheana as meicníocht ghearáin chustaiméara an tsoláthraí seirbhíse agus mura bhfuil tú sásta go fóill, féadfaidh tú teagmháil a dhéanamh le ComReg, ar féidir leis, ag brath ar an ngearán, cabhair a thabhairt duit

source: A comparison of the costs of Broadband plans from the various providers is available from ComReg
ga: Tá rátaí do línte dialaithe agus don Bhanda Leathan ar fáil ón na hISPanna féin

source: Contact your chosen internet service provider and they will explain what you need to do to get connected to the internet from your home
ga: Déan teagmháil leis an soláthraí seirbhíse idirlín a roghnaigh tú agus míneoidh siad duit cad is gá duit a dhéanamh go nascfar leis an idirlíon thú ó do theach
